In [5]:
import pandas as pd

In [6]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

## 1. Math Operations

### 1.1 Operations in columns

In [7]:
# selecting a column and calculating the total sum
df_exams['math score'].sum()

np.int64(66089)

In [9]:
# count, mean, std, max and min
df_exams['math score'].count()

np.int64(1000)

In [11]:
# and we see that it has 1000 rows

df_exams['math score'].mean()    
# it calculates the total sum of the components of the vector and divides it by its length

np.float64(66.089)

In [12]:
df_exams['math score'].std()

15.163080096009468

In [14]:
# the standard deviation of this math score column is 15.16
# this indicates how much the math scores deviates from the mean value (66.089) in the dataset

In [16]:
df_exams['math score'].max()

100

In [17]:
# the highest math score was 100 points

df_exams['math score'].min()

0

In [18]:
# the lowest score was 0 points

In [19]:
# easier calculation with .describe()
df_exams.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [20]:
# and now we got like a summary table with some important statistical values of the df.

### 1.2 Operations in rows

In [22]:
# calculating the sum in a row. for example, let's calculate 
# the sum of the math score, reading score and writing score
df_exams['math score'] + df_exams['reading score'] + df_exams['writing score']

0      218
1      247
2      278
3      148
4      229
      ...
995    282
996    172
997    195
998    223
999    249
Length: 1000, dtype: int64

In [23]:
# So we got the total sum of the scores for each row. For example, if we add the first row scores we have: 72 + 72	+ 74 = 218, and so on..

In [30]:
# calculating the average score and assigning the result to a new column
df_exams['average score'] = (df_exams['math score'] + df_exams['reading score'] + df_exams['writing score'])/3

# we can round the averages to 2 decimals
df_exams['average score'] = df_exams['average score'].round(2)

In [31]:
# showing the dataframe
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,average score
0,female,group B,bachelor's degree,standard,none,72,72,74,72.67
1,female,group C,some college,standard,completed,69,90,88,82.33
2,female,group B,master's degree,standard,none,90,95,93,92.67
3,male,group A,associate's degree,free/reduced,none,47,57,44,49.33
4,male,group C,some college,standard,none,76,78,75,76.33

In [32]:
# So those are different ways to make operations in columns and rows on dataframes.